app/Controllers/Arsip.php

SELECT *
FROM `arsip`
SELECT *
FROM `arsip`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `arsip`
---
    public function dashboard()
    {
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $cariArsip = $this->ArsipModel->search($keyword);
        } else {
            $cariArsip = $this->ArsipModel;
        }

        $data = [
            'arsip' => $cariArsip->paginate(4,'arsip'),
            'pager' => $this->ArsipModel->pager,
            'total_pengumuman' => $this->TotalModel->total_pengumuman(),
            'total_undangan' => $this->TotalModel->total_undangan(),
            'total_nota' => $this->TotalModel->total_nota(),
            'total_pemberitahuan' => $this->TotalModel->total_pemberitahuan(),
            'total' => $this->TotalModel->total(),
        ];