app/Models/ArsipModel.php

SELECT *
FROM `arsip`
WHERE `id_arsip` = '12'
 LIMIT 1
---
    public function detail_data($id_arsip = false){
        if($id_arsip == false){
            return $this->findAll();
        }
        return $this->where(['id_arsip' => $id_arsip])->first();