app/Models/TotalModel.php

    public function total_pengumuman(){
        return $this->db->table('arsip')->where(['kategori' => 'Pengumuman'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `arsip`
WHERE `kategori` = 'Pengumuman'

    public function total_undangan(){
        return $this->db->table('arsip')->where(['kategori' => 'Undangan'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `arsip`
WHERE `kategori` = 'Undangan'

    public function total_nota(){
        return $this->db->table('arsip')->where(['kategori' => 'Nota Dinas'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `arsip`
WHERE `kategori` = 'Nota Dinas'

    public function total_pemberitahuan(){
        return $this->db->table('arsip')->where(['kategori' => 'Pemberitahuan'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `arsip`
WHERE `kategori` = 'Pemberitahuan'

    public function total(){
        return $this->db->table('arsip')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `arsip`